[
  {
    "description": "The year of the Exodus, when the Israelites left Egypt under Moses' leadership.",
    "year": -1446
  },
  {
    "description": "The year King Solomon began building the First Temple in Jerusalem.",
    "year": -966
  },
  {
    "description": "The year the Kingdom of Israel was divided into the northern kingdom (Israel) and southern kingdom (Judah).",
    "year": -931
  },
  {
    "description": "The year the Babylonian exile began after the fall of Jerusalem.",
    "year": -586
  },
  {
    "description": "The year Cyrus the Great issued a decree allowing the Jews to return to Jerusalem.",
    "year": -538
  },
  {
    "description": "The year Nehemiah completed the rebuilding of the walls of Jerusalem.",
    "year": -445
  },
  {
    "description": "The birth year of Jesus Christ, traditionally marked as the start of the Christian calendar.",
    "year": 1
  },
  {
    "description": "The year of the crucifixion and resurrection of Jesus Christ.",
    "year": 33
  },
  {
    "description": "The year Paul began his missionary journeys.",
    "year": 46
  },
  {
    "description": "The year the Temple in Jerusalem was destroyed by the Romans.",
    "year": 70
  },
  {
    "description": "The year the Dead Sea Scrolls were discovered, providing insight into Jewish and early Christian life.",
    "year": 1947
  },
  {
    "description": "The year the state of Israel was established, fulfilling biblical prophecy for many Christians.",
    "year": 1948
  },
  {
    "description": "The year King Hezekiah completed preparations to protect Jerusalem from Assyrian siege, including the Siloam Tunnel.",
    "year": -701
  },
  {
    "description": "The year Josiah began his reforms and rediscovered the Book of the Law in the Temple.",
    "year": -622
  },
  {
    "description": "The year Ezekiel began his prophetic ministry among the exiles in Babylon.",
    "year": -593
  },
  {
    "description": "The year of the rebuilding of the Second Temple in Jerusalem under Zerubbabel's leadership.",
    "year": -516
  },
  {
    "description": "The year Malachi delivered his prophetic message, marking the close of Old Testament prophecy.",
    "year": -430
  },
  {
    "description": "The year the Magi visited the young Jesus, guided by the star of Bethlehem.",
    "year": 6
  },
  {
    "description": "The year of the Apostle Peter's leadership at the Jerusalem Council, addressing Gentile inclusion in the church.",
    "year": 50
  },
  {
    "description": "The year the Apostle John received the Revelation on the island of Patmos.",
    "year": 95
  },
  {
    "description": "The year Elijah was taken to heaven in a chariot of fire.",
    "year": -850
  },
  {
    "description": "The year Jonah preached repentance to the city of Nineveh.",
    "year": -760
  },
  {
    "description": "The year Isaiah prophesied the birth of the Messiah.",
    "year": -740
  },
  {
    "description": "The year Daniel interpreted Nebuchadnezzar's dream of the great statue.",
    "year": -603
  },
  {
    "description": "The year Shadrach, Meshach, and Abednego were saved from the fiery furnace.",
    "year": -600
  },
  {
    "description": "The year Belshazzar saw the handwriting on the wall, marking the fall of Babylon.",
    "year": -539
  },
  {
    "description": "The year the ark of the covenant was captured by the Philistines during the time of Samuel.",
    "year": -1104
  },
  {
    "description": "The year Ruth married Boaz, continuing the lineage to King David.",
    "year": -1100
  },
  {
    "description": "The year David was anointed king by the prophet Samuel.",
    "year": -1010
  },
  {
    "description": "The year Solomon completed the construction of the First Temple.",
    "year": -957
  },
  {
    "description": "The year the prophet Jeremiah lamented the destruction of Jerusalem.",
    "year": -586
  },
  {
    "description": "The year Ezra led a group of exiles back to Jerusalem to restore the law.",
    "year": -458
  }
]
